# Aggregation & Grouping

Grouping data and performing aggregations using Pandas.

In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'city': ['Delhi', 'Mumbai', 'Delhi', 'Chennai', 'Mumbai', 'Delhi'],
    'year': [2021, 2021, 2022, 2022, 2023, 2023],
    'sales': [100, 150, 120, 90, 160, 200],
    'profit': [20, 35, 25, 10, 40, 60]
})

df

      city  year  sales  profit
0    Delhi  2021    100      20
1   Mumbai  2021    150      35
2    Delhi  2022    120      25
3  Chennai  2022     90      10
4   Mumbai  2023    160      40
5    Delhi  2023    200      60

## GroupBy basics

In [4]:
df.groupby('city').sum()

         year  sales  profit
city
Chennai  2022     90      10
Delhi    6066    420     105
Mumbai   4044    310      75

In [5]:
df.groupby('city')['sales'].mean()

city
Chennai     90.0
Delhi      140.0
Mumbai     155.0
Name: sales, dtype: float64

In [6]:
df.groupby(['city', 'year'])['sales'].sum()

city     year
Chennai  2022     90
Delhi    2021    100
         2022    120
         2023    200
Mumbai   2021    150
         2023    160
Name: sales, dtype: int64

## Aggregation functions

In [7]:
df.groupby('city').agg('sum')

         year  sales  profit
city
Chennai  2022     90      10
Delhi    6066    420     105
Mumbai   4044    310      75

In [8]:
df.groupby('city').agg(['mean', 'max'])

           year        sales      profit
           mean   max   mean  max   mean max
city
Chennai  2022.0  2022   90.0   90   10.0  10
Delhi    2022.0  2023  140.0  200   35.0  60
Mumbai   2022.0  2023  155.0  160   37.5  40

In [9]:
df.groupby('city').agg({'sales': 'sum', 'profit': 'mean'})

         sales  profit
city
Chennai     90    10.0
Delhi      420    35.0
Mumbai     310    37.5

## Advanced groupby

In [10]:
df.groupby('city').agg(
    total_sales=('sales', 'sum'),
    avg_profit=('profit', 'mean')
)

         total_sales  avg_profit
city
Chennai           90        10.0
Delhi            420        35.0
Mumbai           310        37.5

In [11]:
df['city_avg_sales'] = df.groupby('city')['sales'].transform('mean')
df

      city  year  sales  profit  city_avg_sales
0    Delhi  2021    100      20           140.0
1   Mumbai  2021    150      35           155.0
2    Delhi  2022    120      25           140.0
3  Chennai  2022     90      10            90.0
4   Mumbai  2023    160      40           155.0
5    Delhi  2023    200      60           140.0

In [12]:
df.groupby('city').filter(lambda x: x['sales'].mean() > 120)

     city  year  sales  profit  city_avg_sales
0   Delhi  2021    100      20           140.0
1  Mumbai  2021    150      35           155.0
2   Delhi  2022    120      25           140.0
4  Mumbai  2023    160      40           155.0
5   Delhi  2023    200      60           140.0

In [13]:
df.groupby('city').apply(lambda x: x.nlargest(1, 'sales'))

C:\Users\DELL\AppData\Local\Temp\ipykernel_8976\3448265254.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('city').apply(lambda x: x.nlargest(1, 'sales'))

              city  year  sales  profit  city_avg_sales
city
Chennai 3  Chennai  2022     90      10            90.0
Delhi   5    Delhi  2023    200      60           140.0
Mumbai  4   Mumbai  2023    160      40           155.0

## Custom aggregation

In [14]:
def sales_range(x):
    return x.max() - x.min()

df.groupby('city')['sales'].agg(sales_range)

city
Chennai      0
Delhi      100
Mumbai      10
Name: sales, dtype: int64